<a href="https://colab.research.google.com/github/Octa-p/DWDM21/blob/main/Project_SUKUNA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Project กลุ่ม
*  present วันที่ 31 สิงหาคม 2564
*  ข้อมูลที่ไปดึงมาจาก 3 แหล่ง
*  แสดงวิธีการโหลด
*  ความเชื่อมโยงของ 3 ตาราง (index)

In [1]:
import pandas as pd

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
import os

In [6]:
path = '/content/drive/My Drive/DWDM2021_DATA'

In [20]:
MobilePhoneNunber = pd.read_csv(os.path.join(path, '7.-mnp.csv'))
MobilePhone = pd.read_csv(os.path.join(path, '2.-.csv'))
FixedPhone = pd.read_csv(os.path.join(path, '1.-.csv'))

In [21]:
MobilePhoneNunber

    Year  months      Value
0   2020       1    83,075
1   2020       2    76,089
2   2020       3    62,526
3   2020       4    31,028
4   2020       5    52,940
5   2020       6    66,562
6   2020       7    61,147
7   2020       8    55,621
8   2020       9    67,481
9   2020      10    68,825
10  2020      11    75,523
11  2020      12   107,830
12  2021       1    97,867
13  2021       2    75,550
14  2021       3    84,757
15  2021       4    56,499

In [22]:
MobilePhone

    Year  Months Service Provider        Value
0   2020       1       TRUEMOVE H   49,773,427
1   2020       1              DTN   27,609,793
2   2020       1              AWN   49,922,320
3   2020       1             ACES       20,000
4   2020       1              TOT    7,270,012
..   ...     ...              ...           ...
91  2020      12             ACES       20,000
92  2020      12              TOT    6,064,504
93  2020      12              CAT    4,986,966
94  2020      12               WS      344,320
95  2020      12              168      120,000

[96 rows x 4 columns]

In [23]:
FixedPhone

       Year  months Service Provider          Value
0    2020.0     1.0              TOT  16,345,000.00
1    2020.0     1.0              CAT     394,000.00
2    2020.0     1.0              AWN     314,000.00
3    2020.0     1.0              TUC   2,097,000.00
4    2020.0     1.0            OTARO      20,000.00
..      ...     ...              ...            ...
323     NaN     NaN              NaN            NaN
324     NaN     NaN              NaN            NaN
325     NaN     NaN              NaN            NaN
326     NaN     NaN              NaN            NaN
327     NaN     NaN              NaN            NaN

[328 rows x 4 columns]